# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети,
надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''
#Решение
answer=input("Enter network/mask: ")
network =answer[0:answer.find('/')].split('.') 
mask = answer[answer.find('/')+1:]
binnetwork= '{:08b}{:08b}{:08b}{:08b}'.format(int(network[0]),int(network[1]),int(network[2]),int(network[3]))[:int(mask)]+'0'*(32-int(mask))
binmask= '1'*int(mask) + '0'*(32-int(mask))
print ('Network:\n{:<12}{:<12}{:<12}{:<12}\n{}    {}    {}    {}    \n\nMask:\n/{}\n{:<12}{:<12}{:<12}{:<12}\n{:12}{:12}{:12}{:12}'.
format(int(binnetwork[:8],2),int(binnetwork[8:16],2),int(binnetwork[16:24],2),int(binnetwork[24:32],2),binnetwork[:8],binnetwork[8:16],binnetwork[16:24],binnetwork[24:32],mask,
int(binmask[0:8],2),int(binmask[8:16],2),int(binmask[16:24],2),int(binmask[24:32],2),binmask[0:8],binmask[8:16],binmask[16:24],binmask[24:32]))
