# -*- coding: utf-8 -*-
'''
Задание 4.7

Преобразовать MAC-адрес mac в двоичную строку такого вида:
'101010101010101010111011101110111100110011001100'


Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

mac = 'AAAA:BBBB:CCCC'
#Решение
mac = mac.replace(':','')
a = '{}{}{}{}{}{}{}{}{}{}{}{}'.format(
(bin(int(mac[0],16))[2:]),
(bin(int(mac[1],16))[2:]),
(bin(int(mac[2],16))[2:]),
(bin(int(mac[3],16))[2:]),
(bin(int(mac[4],16))[2:]),
(bin(int(mac[5],16))[2:]),
(bin(int(mac[6],16))[2:]),
(bin(int(mac[7],16))[2:]),
(bin(int(mac[8],16))[2:]),
(bin(int(mac[9],16))[2:]),
(bin(int(mac[10],16))[2:]),
(bin(int(mac[11],16))[2:]),
)
print (a)
